<a href="https://colab.research.google.com/github/sambhajizambre/SQL/blob/main/SQL_EY_INTERVIEW_QUESTION.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**EY Interview Question:
:-You work for an e-commerce company and you need to analyze customer purchasing behavior.
You have tasked with creating a table to store customer orders and generating a report that shows the top 5 customers
with the highest total order amounts.
The report should include the customers name and the corresponding total order amount......

# First Create table using SQL SERVER DATABASE :-
#syntax

In [ ]:
CREATE TABLE CustomerOrders (
  OrderID INT PRIMARY KEY,
  CustomerName VARCHAR(100),
  OrderAmount DECIMAL(10, 2)
);

INSERT INTO CustomerOrders (OrderID, CustomerName, OrderAmount)
VALUES
  (1, 'John Doe', 500.00),
  (2, 'Jane Smith', 800.00),
  (3, 'Michael Johnson', 1200.00),
  (4, 'Emily Davis', 1500.00),
  (5, 'David Wilson', 950.00),
  (6, 'Sarah Brown', 2000.00),
  (7, 'James Miller', 1800.00),
  (8, 'Olivia Taylor', 600.00),
  (9, 'Ethan Clark', 1400.00),
  (10, 'Ava Lee', 1700.00);

In [ ]:
#METHOD 1:-
USING SUBQUERY IN SQL SERVER:-.

SELECT OrderID,CustomerName,TOTAL_ORDER_AMOUNT
FROM (
SELECT OrderID,CustomerName, SUM(OrderAmount) AS TOTAL_ORDER_AMOUNT,
ROW_NUMBER() OVER(ORDER BY SUM(OrderAmount) DESC) AS ROW_NUMBER
FROM CUSTOMERORDERS
GROUP BY OrderID,CustomerName
) AS TOTAL
WHERE ROW_NUMBER <=5;

In [ ]:
SELECT CustomerName,TOTAL_ORDER_AMOUNT
FROM (
SELECT CustomerName, SUM(OrderAmount) AS TOTAL_ORDER_AMOUNT,
ROW_NUMBER() OVER(ORDER BY SUM(OrderAmount) DESC) AS ROW_NUMBER
FROM CUSTOMERORDERS
GROUP BY CustomerName
) AS TOTAL
WHERE ROW_NUMBER <=5;

In [ ]:
#METHOD 2:-
#USING TOP IN SQL SERVER DATABASE: -

SELECT TOP 5 CustomerName,SUM(OrderAmount) AS TOTAL_ORDER_AMOUNT
FROM CUSTOMERORDERS
GROUP BY CustomerName
ORDER BY TOTAL_ORDER_AMOUNT DESC;

In [ ]:

#.METHOD 3:-
#USING CTE IN SQL SERVER SERVER DATABASE: -
with cte as(
select TOP 5 CustomerName,sum(OrderAmount) as TOTAL_ORDER_AMOUNT from CustomerOrders
group by CustomerName
order by TOTAL_ORDER_AMOUNT desc
)
select row_number() over (order by  TOTAL_ORDER_AMOUNT desc) as ROW_NUM ,CustomerName ,TOTAL_ORDER_AMOUNT from cte

In [ ]:
#.METHOD 4:-
#USING CTE IN SQL SERVER DATABASE: -
with CTE
as
(select customername, SUM(orderamount) AS TOTAL_ORDER_AMOUNT,
dense_rank() over(order by SUM(orderamount) desc) as rank
from CustomerOrders
GROUP BY customername)
select customername,TOTAL_ORDER_AMOUNT
from CTE
where rank <=5;

In [ ]:
#.METHOD 5:- #USING DENSE_RANK IN SQL SERVER DATABASE : -
select TOP 5 customername, sum(orderamount) as TOTAL_ORDER_AMOUNT,
dense_rank() over( order by sum(orderamount) desc) as ranks
from CustomerOrders
GROUP by customername ;

# USING MY SQL DATABASE :-

In [ ]:
#METHOD 1:- USING LIMIT IN MY SQL DATABASE : -
SELECT CUSTOMERNAME, SUM(OrderAmount) AS TOTAL_ORDER_AMOUNT
FROM CUSTOMERORDERS
GROUP BY CUSTOMERNAME
ORDER BY TOTAL_ORDER_AMOUNT DESC LIMIT 5;

In [ ]:
#METHOD 2:- USING DENSE_RANK IN MY SQL DATABASE : -
select customername, sum(orderamount) as TOTAL_ORDER_AMOUNT,
dense_rank() over( order by sum(orderamount) desc) as ranks
from CustomerOrders
GROUP by customername  limit 5;

In [ ]:
#METHOD 3:- USING CTE IN MY SQL DATABASE : -
with CTE as
(select CustomerName, sum(OrderAmount) as TOTAL_ORDER_AMOUNT from CustomerOrders
group by CustomerName
order by TOTAL_ORDER_AMOUNT desc
limit 5)
select row_number() over (order by  TOTAL_ORDER_AMOUNT desc) as ROW_NUM ,CustomerName ,TOTAL_ORDER_AMOUNT from CTE